---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.MEPNetworkIterator
source: html/94af7789-3572-85f7-99de-71c8199056b0.htm
---
# MEPNetworkIterator Members

Creates an iterator by the analytical model data to visit all connected components in the network.